In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('raw_data.csv')

In [3]:
df.sample(10)

      bed  bath  square         city  year_built     home_type   price
451   2.0   1.0   815.0      Hoboken         NaN           NaN  2600.0
401   2.0   1.0  1006.0      Hoboken         1.0     APARTMENT  2650.0
471   2.0   1.0  1006.0      Hoboken         1.0     APARTMENT  2150.0
1156  2.0   1.0   650.0  Jersey City      1925.0         CONDO  2500.0
1329  2.0   1.0   750.0   Union City      1950.0  MULTI_FAMILY  1475.0
901   2.0   1.5  1006.0  Jersey City         NaN           NaN  3153.0
70    2.0   1.5  1006.0      Hoboken         NaN           NaN  2850.0
508   2.0   2.0  1200.0      Hoboken         1.0     APARTMENT  2900.0
1177  2.0   1.5  1006.0  Jersey City         NaN           NaN  1985.0
1104  2.0   1.5  1006.0  Jersey City         NaN           NaN  1995.0

In [4]:
df.describe()

               bed         bath       square   year_built         price
count  1417.000000  1417.000000  1417.000000   632.000000   1417.000000
mean      1.713479     1.299224   974.873677   449.917722   2543.437544
std       0.948412     0.459619   393.962247   820.047389   1122.110909
min       0.000000     0.500000   180.000000     1.000000    175.000000
25%       1.000000     1.000000   733.000000     1.000000   1795.000000
50%       2.000000     1.000000   953.000000     1.000000   2300.000000
75%       2.000000     1.500000  1060.000000     1.000000   2950.000000
max       5.000000     4.000000  5000.000000  2017.000000  13000.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1417 entries, 0 to 1416
Data columns (total 7 columns):
bed           1417 non-null float64
bath          1417 non-null float64
square        1417 non-null float64
city          1417 non-null object
year_built    632 non-null float64
home_type     632 non-null object
price         1417 non-null float64
dtypes: float64(5), object(2)
memory usage: 77.6+ KB

In [6]:
df['bed'].value_counts()

2.0    536
1.0    485
3.0    233
0.0    121
4.0     38
5.0      4
Name: bed, dtype: int64

In [7]:
df['bath'].value_counts()

1.0    882
1.5    280
2.0    227
3.0     15
2.5      5
4.0      5
3.5      2
0.5      1
Name: bath, dtype: int64

In [8]:
df['bed'] = df['bed'].astype('int')

In [9]:
df['square'] = df['square'].astype('int')

In [10]:
df['price'] = df['price'].astype('int')

In [11]:
df['year_built'] = df['year_built'].fillna(0)

In [12]:
df['year_built'] = df['year_built'].astype('int')

In [13]:
df['home_type'] = df['home_type'].fillna('None')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1417 entries, 0 to 1416
Data columns (total 7 columns):
bed           1417 non-null int64
bath          1417 non-null float64
square        1417 non-null int64
city          1417 non-null object
year_built    1417 non-null int64
home_type     1417 non-null object
price         1417 non-null int64
dtypes: float64(1), int64(4), object(2)
memory usage: 77.6+ KB

In [15]:
df.describe()

               bed         bath       square   year_built         price
count  1417.000000  1417.000000  1417.000000  1417.000000   1417.000000
mean      1.713479     1.299224   974.873677   200.669019   2543.437544
std       0.948412     0.459619   393.962247   591.373253   1122.110909
min       0.000000     0.500000   180.000000     0.000000    175.000000
25%       1.000000     1.000000   733.000000     0.000000   1795.000000
50%       2.000000     1.000000   953.000000     0.000000   2300.000000
75%       2.000000     1.500000  1060.000000     1.000000   2950.000000
max       5.000000     4.000000  5000.000000  2017.000000  13000.000000

In [16]:
df.sample(10)

      bed  bath  square         city  year_built  home_type  price
291     1   1.0     700      Hoboken           1  APARTMENT   1850
1416    1   1.0     543   Union City           0       None   1400
370     1   1.0     600      Hoboken           1  APARTMENT   1700
663     1   1.0     733  Jersey City           0       None   2590
1138    3   1.0    1500  Jersey City           0       None   2150
1107    1   1.0     733  Jersey City           0       None   1595
582     1   1.0     733  Jersey City           0       None   2550
885     2   1.5    1006  Jersey City           0       None   1500
1234    1   1.0     500   Union City           1  APARTMENT   1375
1253    2   1.5    1006   Union City           0       None   1450

In [17]:
df['city'].value_counts()

Jersey City      638
Hoboken          547
Union City       220
HOBOKEN            5
North Bergen       3
Jersey city        2
West New York      1
UNION CITY         1
Name: city, dtype: int64

In [18]:
df.loc[df['city'] == 'HOBOKEN', 'city'] = 'Hoboken'
df.loc[df['city'] == 'Jersey city', 'city'] = 'Jersey City'
df.loc[df['city'] == 'UNION CITY', 'city'] = 'Union City'

In [19]:
df = df[df.city != 'North Bergen']
df = df[df.city != 'West New York']

In [20]:
df['city'].value_counts()

Jersey City    640
Hoboken        552
Union City     221
Name: city, dtype: int64

In [21]:
df['year_built'].value_counts()

0       785
1       484
1901     35
1900     10
1920      8
1910      8
2005      5
2000      5
2006      5
2008      5
2015      5
2002      3
2010      3
1990      3
1921      3
1897      2
1930      2
1892      2
1890      2
1889      2
1925      2
1950      2
2014      2
2013      2
2009      2
2007      2
2004      2
2001      2
1967      1
1957      1
1800      1
1880      1
2011      1
1898      1
1905      1
1908      1
1999      1
1916      1
1917      1
1987      1
1985      1
1924      1
1973      1
1928      1
1970      1
1932      1
2016      1
2017      1
Name: year_built, dtype: int64

In [22]:
df['home_type'].value_counts()

None             785
APARTMENT        504
MULTI_FAMILY      77
CONDO             32
TOWNHOUSE          9
SINGLE_FAMILY      6
Name: home_type, dtype: int64

In [23]:
df.to_csv('clean_data.csv', index=False)